In [4]:
import pandas as pd
import numpy as np
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'), index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [5]:
frame

               b         d         e
Utah   -1.567205 -1.106402 -0.855645
Ohio    0.595547  0.539334 -0.193705
Texas   0.131391 -1.223551 -0.403229
Oregon -0.053917 -1.372605  0.648229

In [6]:
list('bde')

['b', 'd', 'e']

In [11]:
f = lambda x: x.max() - x.min()
0.53+1.37

1.9000000000000001

In [9]:
frame.apply(f)

b    2.162752
d    1.911939
e    1.503875
dtype: float64

In [12]:
format = lambda x: '%.2f' % x

In [13]:
frame.applymap(format)

            b      d      e
Utah    -1.57  -1.11  -0.86
Ohio     0.60   0.54  -0.19
Texas    0.13  -1.22  -0.40
Oregon  -0.05  -1.37   0.65

In [14]:
frame['e'].map(format)

Utah      -0.86
Ohio      -0.19
Texas     -0.40
Oregon     0.65
Name: e, dtype: object

In [19]:
df = pd.DataFrame({'A': [1,2,3,4],  
                  'B':[10,20,30,40], 
                  'C':[20,409,60,80]},index=['Row 1','Row 2', 'Row 3','Row 4'])

In [20]:
df

       A   B    C
Row 1  1  10   20
Row 2  2  20  409
Row 3  3  30   60
Row 4  4  40   80

In [26]:
def custom_sum(row):
    return row.sum()

df['D'] = df.apply(custom_sum,axis=1)

In [27]:
df

       A   B    C      D
Row 1  1  10   20   31.0
Row 2  2  20  409  431.0
Row 3  3  30   60   93.0
Row 4  4  40   80  124.0

In [28]:
df.loc['Row 5'] = df.apply(custom_sum,axis=0) 
df

          A      B      C      D
Row 1   1.0   10.0   20.0   31.0
Row 2   2.0   20.0  409.0  431.0
Row 3   3.0   30.0   60.0   93.0
Row 4   4.0   40.0   80.0  124.0
Row 5  10.0  100.0  569.0  679.0

In [30]:
def multiply_by_2(val):
    return val * 2

df['D'] = df['C'].apply(multiply_by_2)

In [31]:
df

          A      B      C       D
Row 1   1.0   10.0   20.0    40.0
Row 2   2.0   20.0  409.0   818.0
Row 3   3.0   30.0   60.0   120.0
Row 4   4.0   40.0   80.0   160.0
Row 5  10.0  100.0  569.0  1138.0

In [35]:
df['D']=df.apply(lambda x:x.sum(),axis=1)

In [36]:
df

          A      B      C      D
Row 1   1.0   10.0   20.0   31.0
Row 2   2.0   20.0  409.0  431.0
Row 3   3.0   30.0   60.0   93.0
Row 4   4.0   40.0   80.0  124.0
Row 5  10.0  100.0  569.0  679.0

In [37]:
df.loc['Row 5'] = df.apply(lambda x:x.sum(), axis=0)

In [40]:
df

          A      B       C       D
Row 1   1.0   10.0    20.0    31.0
Row 2   2.0   20.0   409.0   431.0
Row 3   3.0   30.0    60.0    93.0
Row 4   4.0   40.0    80.0   124.0
Row 5  20.0  200.0  1138.0  1358.0

In [39]:
df.apply(custom_sum, axis=1, result_type='broadcast')

            A       B       C       D
Row 1    62.0    62.0    62.0    62.0
Row 2   862.0   862.0   862.0   862.0
Row 3   186.0   186.0   186.0   186.0
Row 4   248.0   248.0   248.0   248.0
Row 5  2716.0  2716.0  2716.0  2716.0

In [41]:
df

          A      B       C       D
Row 1   1.0   10.0    20.0    31.0
Row 2   2.0   20.0   409.0   431.0
Row 3   3.0   30.0    60.0    93.0
Row 4   4.0   40.0    80.0   124.0
Row 5  20.0  200.0  1138.0  1358.0

In [49]:
def cal_multi_col(row):
    return [row['A'] * 2, row['B'] * 3]

df.apply(cal_multi_col, axis=1, result_type='expand')

          0      1
Row 1   2.0   30.0
Row 2   4.0   60.0
Row 3   6.0   90.0
Row 4   8.0  120.0
Row 5  40.0  600.0

In [50]:
res = df.apply(cal_multi_col,axis=1,result_type='expand') 
df[res.columns] = res

In [51]:
df

          A      B       C       D     0      1
Row 1   1.0   10.0    20.0    31.0   2.0   30.0
Row 2   2.0   20.0   409.0   431.0   4.0   60.0
Row 3   3.0   30.0    60.0    93.0   6.0   90.0
Row 4   4.0   40.0    80.0   124.0   8.0  120.0
Row 5  20.0  200.0  1138.0  1358.0  40.0  600.0

In [52]:
df['New'] = df.apply(cal_multi_col, axis=1, result_type='reduce')

In [53]:
df

          A      B       C       D     0      1            New
Row 1   1.0   10.0    20.0    31.0   2.0   30.0    [2.0, 30.0]
Row 2   2.0   20.0   409.0   431.0   4.0   60.0    [4.0, 60.0]
Row 3   3.0   30.0    60.0    93.0   6.0   90.0    [6.0, 90.0]
Row 4   4.0   40.0    80.0   124.0   8.0  120.0   [8.0, 120.0]
Row 5  20.0  200.0  1138.0  1358.0  40.0  600.0  [40.0, 600.0]

In [54]:
df.applymap(np.square)

,A,B,C,D,0,1,New
Row 1,1.0,100.0,400.0,961.0,4.0,900.0,"[4.0, 900.0]"
Row 2,4.0,400.0,167281.0,185761.0,16.0,3600.0,"[16.0, 3600.0]"
Row 3,9.0,900.0,3600.0,8649.0,36.0,8100.0,"[36.0, 8100.0]"
Row 4,16.0,1600.0,6400.0,15376.0,64.0,14400.0,"[64.0, 14400.0]"
Row 5,400.0,40000.0,1295044.0,1844164.0,1600.0,360000.0,"[1600.0, 360000.0]"